tutorials/mixingPopulationBalance/constant/populationBalanceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      populationaBalanceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

populationBalanceModel mixingPbe;

mixingPbeCoeffs
{
    mixing
    {
        mixingModel      turbulentMixing;

        diffusionModel
        {
            mixingDiffusionModel  turbulentDiffusion;
            gammaLam    gammaLam [ 0 2 -1 0 0 0 0 ] 1.0e-6;
            Sc    0.7;
        }

        mixing on;

        mixingKernel
        {
            Cphi          Cphi  [ 0 0 0 0 0 0 0 ] 2.0;
            c             c     [ 0 0 0 0 0 0 0 ] 1.0;
            mixingKernel  IEM;
        }

        odeCoeffs
        {
            ATol    1.0e-6;
            RTol    1.0e-4;
            fac     0.9;
            facMin  0.5;
            facMax  2.0;
            minLocalDt 1.0e-9;
        }
    }

    minMixtureFractionVariance 1.0e-2;
    minEnvironmentWeight 1.0e-2;

    aggregation on;

    aggregationKernel
    {
        aggregationKernel turbulentBrownian;

        //molarMass       molarMass   [ 1 0 0 0 -1 0 0 ] 14000;
        //molarVol1       molarVol1   [ 0 3 0 0 -1 0 0 ] 0.00007438;
        //molarVol2       molarVol2   [ 0 3 0 0 -1 0 0 ] 0.000018115;
        //soluteConc      soluteConc  [ 1 -3 0 0 0 0 0 ] 3.0;
    }

    breakup off;

    breakupKernel
    {
        breakupKernel LuoSvendsen;

        Cb        Cb        [ 0 0 0 0 0 0 0 ] 0.6e-3;
        epsilonExp          0.75;
        nuExp              -1.25;
        sizeExp             1.0;
    }

    daughterDistribution
    {
        daughterDistribution symmetricFragmentation;
    }

    growth off;

    growthModel
    {
        growthModel	constant;
        minAbscissa     minAbscissa [0 -2 0 0 0 0 0] 0.0;
        maxAbscissa     maxAbscissa [0 -2 0 0 0 0 0] 1.0;

        Cg              Cg        [0 3 -1 0 0 0 0 ] 1.0;
    }

    nucleation off;

    nucleationModel
    {
        nucleationModel none;
    }

    diffusionModel
    {
        diffusionModel  turbulentDiffusion;
        gammaLam        gammaLam    [ 0 2 -1 0 0 0 0 ] 1.0e-6;
        Sc              0.7;
    }

    environmentMixingModel
    {
        environmentMixingModel      IEM;
        Cphi          Cphi  [ 0 0 0 0 0 0 0 ] 2;
    }

    odeCoeffs
    {
        ATol    1.0e-8;
        RTol    1.0e-4;
        fac     0.9;
        facMin  0.5;
        facMax  2.0;
        minLocalDt 1.0e-9;
    }
}


// ************************************************************************* //
