tutorials/mixingPopulationBalance/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   nonuniform List<scalar> 
3000
(
99999.5295341
99999.5238381
99999.5209643
99999.5192487
99999.5179482
99999.5170162
99999.5164648
99999.5161102
...
)
;

boundaryField
{
    inlet1
    {
        type            zeroGradient;
    }
    inlet2
    {
        type            zeroGradient;
    }
    outlet
    {
        type            calculated;
        value           uniform 99899.2;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
99999.5295341
99998.5102572
99997.5016158
99996.4926406
99995.4846725
99994.4767211
99993.4689046
99992.4610958
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
