tutorials/mixingPopulationBalance/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   nonuniform List<scalar> 
3000
(
100000.033333
100000.027637
100000.024764
100000.023048
100000.021748
100000.020815
100000.020264
100000.019909
...
)
;

boundaryField
{
    inlet1
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
15
(
0
2.31730048634e-13
2.30628055653e-13
0
0
2.28068755749e-13
0
2.2744566054e-13
0
0
0
2.31470313803e-13
0
0
0
)
;
        value           nonuniform List<scalar> 
15
(
100000.033333
100000.027637
100000.024764
100000.023048
100000.021748
100000.020815
100000.020264
100000.019909
100000.019632
100000.019406
100000.019235
100000.01911
100000.019022
100000.018969
100000.018946
)
;
    }
    inlet2
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
15
(
0
2.36916860002e-13
-2.32882805601e-13
0
2.30110380957e-13
-2.28957970655e-13
0
2.27445660545e-13
-2.27051615092e-13
2.28068755747e-13
0
0
0
2.31730048634e-13
0
)
;
        value           nonuniform List<scalar> 
15
(
100000.018946
100000.018969
100000.019022
100000.01911
100000.019235
100000.019406
100000.019632
100000.019909
100000.020264
100000.020815
100000.021748
100000.023048
100000.024764
100000.027637
100000.033333
)
;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 100000;
    }
    walls
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
200
(
100000.033333
100000.021655
100000.020612
100000.019236
100000.018866
100000.018513
100000.018295
100000.018085
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
